mhmeducations.com

In [4]:
import pandas as pd

In [6]:
data = {'Company':['A','A','B','B','C','C'], 
        'Person': ['Ram','Sam','Ani','Ravi','Sara','Raj'], 'Sales': [200,120,340,124,243,350]}

In [7]:
df = pd.DataFrame(data)
print(df)

  Company Person  Sales
0       A    Ram    200
1       A    Sam    120
2       B    Ani    340
3       B   Ravi    124
4       C   Sara    243
5       C    Raj    350

In [8]:
group_by_company_name=df.groupby('Company')

In [9]:
group_by_company_name.mean()

         Sales
Company
A        160.0
B        232.0
C        296.5

In [10]:
df.groupby('Company').mean()

         Sales
Company
A        160.0
B        232.0
C        296.5

In [11]:
group_by_company_name.std()

              Sales
Company
A         56.568542
B        152.735065
C         75.660426

In [12]:
group_by_company_name.min()

        Person  Sales
Company
A          Ram    120
B          Ani    124
C          Raj    243

In [13]:
group_by_company_name.max()

        Person  Sales
Company
A          Sam    200
B         Ravi    340
C         Sara    350

In [14]:
group_by_company_name.count()

         Person  Sales
Company
A             2      2
B             2      2
C             2      2

In [15]:
group_by_company_name.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
A         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
B         2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
C         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [16]:
group_by_company_name.describe().transpose()

Company               A           B           C
Sales count    2.000000    2.000000    2.000000
      mean   160.000000  232.000000  296.500000
      std     56.568542  152.735065   75.660426
      min    120.000000  124.000000  243.000000
      25%    140.000000  178.000000  269.750000
      50%    160.000000  232.000000  296.500000
      75%    180.000000  286.000000  323.250000
      max    200.000000  340.000000  350.000000

In [18]:
group_by_company_name.describe().transpose()['A']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: A, dtype: float64